Revit 2027 API
EnergyAnalysisDetailModel.GetAnalyticalSurfaces Method
 The collection of analytical surfaces.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<EnergyAnalysisSurface> GetAnalyticalSurfaces()
Public Function GetAnalyticalSurfaces As IList(Of EnergyAnalysisSurface)
public:
IList<EnergyAnalysisSurface^>^ GetAnalyticalSurfaces()
member GetAnalyticalSurfaces : unit -> IList<EnergyAnalysisSurface>
Return Value
IList<EnergyAnalysisSurface>
 Returns the analytical surfaces after model calculation.
See Also
Reference
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace